# Q.2 How to merge the DataFrame to obtain a Pivot Table.

In [3]:
#Import library

import pandas as pd

In [4]:
#Create a Example

user_id=["user_001","user_002","user_003","user_004"]
ratings=[3.0,1.0,5.0,2.0]
title=["Pulp Fiction (1994)","Pulp Fiction (1994)","Pulp Fiction (1994)","Pulp Fiction (1994)"]

In [5]:
#Storing the above Example in a Form of a DataFrame

df=pd.DataFrame({"userId":user_id,
                "Ratings":ratings,
                "Title":title})
df

     userId  Ratings                Title
0  user_001      3.0  Pulp Fiction (1994)
1  user_002      1.0  Pulp Fiction (1994)
2  user_003      5.0  Pulp Fiction (1994)
3  user_004      2.0  Pulp Fiction (1994)

In [6]:
#create a Pivot Table from the above DataFrame

df.pivot(index="userId",columns="Title",values="Ratings")

Title     Pulp Fiction (1994)
userId
user_001                  3.0
user_002                  1.0
user_003                  5.0
user_004                  2.0

### ------------------------------------------------Question 2 Ends -------------------------------------------------------